package thai2karaoke

// Consonant initial forms.
var leading = map[rune]string{
	'ก': "k", 'ข': "kh", 'ฃ': "kh", 'ค': "kh", 'ฅ': "kh", 'ฆ': "kh",
	'ง': "ng", 'จ': "ch", 'ฉ': "ch", 'ช': "ch", 'ซ': "s", 'ฌ': "ch",
	'ญ': "y", 'ฎ': "d", 'ฏ': "t", 'ฐ': "th", 'ฑ': "th", 'ฒ': "th",
	'ณ': "n", 'ด': "d", 'ต': "t", 'ถ': "th", 'ท': "th", 'ธ': "th",
	'น': "n", 'บ': "b", 'ป': "p", 'ผ': "ph", 'ฝ': "f", 'พ': "ph",
	'ฟ': "f", 'ภ': "ph", 'ม': "m", 'ย': "y", 'ร': "r", 'ล': "l",
	'ว': "w", 'ศ': "s", 'ษ': "s", 'ส': "s", 'ห': "h", 'ฬ': "l",
	'อ': "o", 'ฮ': "h",
}

// Final consonant forms.
var finals = map[rune]string{
	'ก': "k", 'ข': "k", 'ค': "k", 'ฆ': "k", 'ฅ': "k",
	'ง': "ng", 'จ': "t", 'ช': "t", 'ซ': "t", 'ฌ': "t",
	'ญ': "n", 'ฎ': "t", 'ฏ': "t", 'ฐ': "t", 'ฑ': "t", 'ฒ': "t",
	'ด': "t", 'ต': "t", 'ถ': "t", 'ท': "t", 'ธ': "t", 'น': "n",
	'บ': "p", 'ป': "p", 'ผ': "p", 'ฝ': "p", 'พ': "p", 'ฟ': "p", 'ภ': "p",
	'ม': "m", 'ย': "n", 'ร': "n", 'ล': "n", 'ฬ': "n", 'อ': "", 'ฮ': "h",
}

// Vowel codes: pattern around consonant to RTGS nucleus.
var vowel = map[string]string{
	"ะ": "a", "า": "a", "ั": "a", "ำ": "am", "ไ": "ai", "ใ": "ai", "็อ": "o", "โ": "o", "เ": "e", "แ": "ae",
	"ิ": "i", "ี": "i", "ึ": "ue", "ื": "ue", "ุ": "u", "ู": "u",
	"เอีย": "ia", "เอือ": "uea", "อัว": "ua",
	"เาะ": "o", "ออ": "o", "เอะ": "e", "เอ": "e", "แอะ": "ae", "แอ": "ae",
	"เออะ": "oe", "เออ": "oe", "เอิ": "oe", "เอือะ": "uea", "เอียะ": "ia", "ัว": "ua",
	"อัวะ": "ua", "เเอ": "ae", "เอา": "ao", "เอียวย": "iao", "เอือย": "ueai",
}
